{"url": "https://www.uscis.gov/green-card", "title": "Green Card | USCIS", "text": "Green Card\nAlert Type info\nALERT:\nEffective January 22, 2025, USCIS waives any and all requirements that applicants for adjustment of status to that of a lawful permanent resident present documentation on their Form I-693, Report of Immigration Medical Examination and Vaccination Record, that they received the COVID-19 vaccination. USCIS will not issue any Request for Evidence (RFE) or Notice of Intent to Deny (NOID) related to proving a COVID-19 vaccination.  USCIS will not deny any adjustment of status application based on the applicant’s failure to present documentation that they received the COVID-19 vaccination.\nHaving a Green Card (officially known as a\nPermanent Resident Card\nallows you to live and work permanently in the United States. The steps you must take to apply for a Green Card will vary depending on your individual situation.\nTopics\nGreen Card Eligibility Categories\nFind the eligibility category that fits your immigration situation, research how to apply, and learn whether your family members can also apply with you.\nGreen Card Process and Procedures\nRead about the general processes and procedures to help you apply for a Green Card.\nHow to Apply for a Green Card\nThinking about applying for a Green Card? Find out if you’re eligible, and get more information about living and working in the U.S. permanently.\nWhile Your Green Card Application is Pending with USCIS\nWe have some helpful information about updating your address, case processing times, case status updates, and travel.\nReplace Your Green Card\nLearn more about how and when to replace your Green Card.\nAdjustment of Status Guidance\nFor policy guidance on adjustment of status, see Volume 7: Adjustment of Status of the USCIS Policy Manual.\nWas this page helpful?\nYes\nNo\nThis page was not helpful because the content:\nSelect a reason\nhas too little information\nhas too much information\nis confusing\nis out of date\nother\nHow can the content be improved?\n0\n/ 2000\nTo protect your privacy, please do not include any personal information in your feedback. Review our\nPrivacy Policy\n.", "metadata": {}, "timestamp": "2025-03-08T13:45:52.279763"}
{"url": "https://www.uscis.gov/citizenship", "title": "Citizenship Resource Center | USCIS", "text": "Citizenship Resource Center\nAlert Type info\nVisit the\nFiscal Year 2024 Citizenship and Assimilation Grant Program Award\npage to view the list of USCIS-funded programs and learn more about the recipients.\nThe Citizenship Resource Center has a collection of helpful resources and free study materials for a variety of users including:\nImmigrants who are interested in becoming U.S. citizens.\nLawful permanent residents (LPRs) will find information about the naturalization process, eligibility requirements, and study materials to prepare for the naturalization interview and test.\nEducators who play a critical role in preparing learners.\nEducators including teachers, volunteers, and program administrators will find several resources for the classroom. Educators can also search for free USCIS training seminars designed to enhance the skills needed to teach U.S. history, civics, and the naturalization process to immigrant students.\nOrganizations that are interested in supporting immigrants in becoming citizens and assisting them to assimilate into American civic society.\nWhether an organization is just beginning to help immigrants on their journey towards citizenship or is an experienced service provider, they will find resources to help enhance their overall efforts and programs.\nThe Citizenship Resource Center is managed by the Office of Citizenship. Learn more about the\nOffice of Citizenship\nand its mission.\nTopics\nLearn About Citizenship\nLearn about the naturalization process and eligibility requirements to become a U.S. citizen.\nApply for Citizenship\nApply for naturalization to become a citizen. File your N-400, Application for Naturalization, online.\nFind Study Materials and Resources\nFind free study materials and resources to prepare for the naturalization interview and test.\nResources for Educational Programs\nEducators can find materials to supplement classroom resources and learn about upcoming training seminars.\nOutreach Tools\nOrganizations can find helpful tools and resources to support immigrants interested in becoming citizens.\nWas this page helpful?\nYes\nNo\nThis page was not helpful because the content:\nSelect a reason\nhas too little information\nhas too much information\nis confusing\nis out of date\nother\nHow can the content be improved?\n0\n/ 2000\nTo protect your privacy, please do not include any personal information in your feedback. Review our\nPrivacy Policy\n.", "metadata": {}, "timestamp": "2025-03-08T13:45:54.631354"}
{"url": "https://www.uscis.gov/forms/all-forms", "title": "All Forms | USCIS", "text": "All Forms\nSearch all USCIS forms.\nFile your form online\nfor a more convenient and secure experience. For forms available only in paper, select the Form Details button to download the form and instructions. USCIS forms and USCIS online accounts are always free.\nFBI Privacy Notice\nUSCIS may use your biometrics to obtain the criminal history records of the Federal Bureau of Investigation (FBI), for identity verification, to determine eligibility, to create immigration documents (for example, Permanent Resident Card, Employment Authorization Document), or any purpose authorized by the Immigration and Nationality Act, as amended and any other applicable statute. You may obtain a copy of your own FBI record using the procedures outlined at 28 CFR 16.30-16.34. For more information, please visit:\nwww.fbi.gov/how-we-can-help-you/more-fbi-services-and-information/compact-council/guiding-principles-noncriminal-justice-applicants-privacy-rights\n.\nFor information regarding how the FBI will use your fingerprints, please visit\nwww.fbi.gov/how-we-can-help-you/more-fbi-services-and-information/compact-council/privacy-act-statement\n.\nFilter by category\nFilter by category\nForms\nAdoptions-Based Forms\nCitizenship and Naturalization-Based  Forms\nEmployment-Based Forms\nFamily-Based Forms\nGreen Card-Based Forms\nHumanitarian Benefits-Based Forms\nShow forms available to file online first. Asc\nShow forms available to file online first. Desc\nSearch by content\nShow forms available to file online first.\nAR-11 | Alien’s Change of Address Card\nAll aliens in the United States must report a change of address to USCIS within 10 days (except A and G visa holders and visa waiver visitors) of moving.\nFile Online\nForm Details\nEOIR-29 | Notice of Appeal to the Board of Immigration Appeals from a Decision of a DHS Officer\nUse this form to appeal a USCIS decision on a Form I-130 or Form I-360 Widow(er).\nForm Details\nG-28 | Notice of Entry of Appearance as Attorney or Accredited Representative\nUse this form to provide information about your eligibility to act on behalf of an applicant, petitioner, or respondent.\nForm Details\nG-28I | Notice of Entry of Appearance as Attorney in Matters Outside the Geographical Confines of the United States\nUse this form to provide notice that an attorney admitted to practice of the law in a country other than the United States seeks to appear before DHS in a matter outside the geographical confines of the United States.\nForm Details\nG-325A | Biographic Information (for Deferred Action)\nUse this form to provide biographic information when submitting a request for deferred action for certain military service members and their family members, or non-military deferred action (other than deferred action based on Deferred Action for Childhood Arrivals (DACA), Violence Against Women Act A-3, G-5 nonimmigrants , and T and U nonimmigrant visas).\nForm Details\nG-639 | Freedom of Information/Privacy Act and Online FOIA Request\nUse our online FOIA system to request: Your own immigration record, Another person’s immigration record, or Non-A-File information such as policies, data, or communications.\nFile Online\nForm Details\nG-845 | Verification Request\nUse this form to verify the immigration status of applications for federal, state, or local public benefits and licenses.\nForm Details\nG-845 Supplement | Verification Request\nUse this form to request detailed information on an individual’s immigration status, citizenship, and sponsorship.\nForm Details\nG-884 | Request for the Return of Original Documents\nUse this form to request the return of original documents submitted to establish eligibility for an immigration benefit.\nForm Details\nG-1041 | Genealogy Index Search Request\nUse Form G-1041 to request a search of USCIS historical indices. (To obtain copies of USCIS historical records, use Form G-1041A, Genealogy Records Request.)\nForm Details\nG-1041A | Genealogy Records Request\nUse Form G-1041A to obtain copies of USCIS historical records. (To request an index search of USCIS historical records, use Form G-1041, Genealogy Index Search Request.)\nForm Details\nG-1055 | Fee Schedule\nUse this form to verify fee information for immigration forms.\nForm Details\nG-1145 | E-Notification of Application/Petition Acceptance\nUse this form to request a text message and/or email when USCIS accepts your form.\nForm Details\nG-1256 | Declaration for Interpreted USCIS Interview\nThe interviewing officer uses this form to: Record the presence of  an interpreter that you have provided for your USCIS interview; Document your satisfaction with the interpreter’s ability to interpret from English to your language, and from your language to English; Acknowledge that your interpreter may learn confidential information during your interview;  \nEnsure the interpreter understands the requirements to serve as an interpreter, which includes accurately, literally, and fully interpreting for both you and the interviewing officer; and Notify you that the interviewing officer can deny permission for the interpreter to participate in the interview\nForm Details\nG-1450 | Authorization for Credit Card Transactions\nUse this form to pay fees for any form processed at a USCIS lockbox. There is no additional fee to pay with your credit card.\nForm Details\nG-1566 | Request for Certificate of Non-Existence\nUse Form G-1566 to determine if specific immigration records exist within our database. If we determine the records you inquired about do not exist, we will issue a Certificate of Non-Existence.\nForm Details\nI-9 | Employment Eligibility Verification\nUse Form I-9 to verify the identity and employment authorization of individuals hired for employment in the United States.\nForm Details\nI-90 | Application to Replace Permanent Resident Card (Green Card)\nUse this form to replace your Permanent Resident Card (also known as your Green Card).\nFile Online\nForm Details\nI-102 | Application for Replacement/Initial Nonimmigrant Arrival-Departure Document\nUse this form if you are a nonimmigrant and need to apply for a new or replacement Form I-94 or I-95, Nonimmigrant Arrival-Departure Document.\nForm Details\nI-129 | Petition for a Nonimmigrant Worker\nPetitioners use this form to file on behalf of a nonimmigrant worker to come to the United States temporarily to perform services or labor, or to receive training, as an H-1B, H-2A, H-2B, H-3, L-1, O-1, O-2, P-1, P-1S, P-2, P-2S, P-3, P-3S, Q-1 or R-1 nonimmigrant worker. Petitioners may also use this form to request an extension of stay in or change of status to E-1, E-2, E-3, H-1B1 or TN, or one of the above classifications for an alien.\nFile Online\nForm Details\nI-129CW | Petition for a CNMI-Only Nonimmigrant Transitional Worker\nAn employer uses this form to petition U.S. Citizenship and Immigration Services (USCIS) for an alien who is ineligible for another employment-based nonimmigrant classification to work as a nonimmigrant in the Commonwealth of the Northern Mariana Islands (CNMI) temporarily as a CW-1, CNMI-Only Transitional Worker.\nForm Details\nI-129CWR | Semiannual Report for CW-1 Employers\nAn employer of an approved Form I-129CW, Petition for Commonwealth of Northern Mariana Islands (CNMI) Only Transitional Worker (CW-1), uses Form I-129CWR to verify the continued employment and payment of each worker under the terms and conditions of the approved petition.\nForm Details\nI-129F | Petition for Alien Fiancé(e)\nUse this form to petition to bring your fiancé(e) (K-1) and their children (K-2) to the U.S. so you may marry your fiancé(e), or to bring your spouse (K-3) and their children (K-4) to the U.S. to apply for lawful permanent resident status.\nForm Details\nI-129S | Nonimmigrant Petition Based on Blanket L Petition\nUse this form to classify alien employees as L-1 nonimmigrant intracompany transferees (executives, managers, or specialized knowledge professionals) under a previously approved blanket L petition.\nForm Details\nI-130 | Petition for Alien Relative\nUse this form if you (the petitioner) are a U.S. citizen, lawful permanent resident, or U.S. national and you need to establish your qualifying relationship with an eligible relative (the beneficiary) who wishes to come to or stay in the United States permanently and apply for the Permanent Resident Card (also called a Green Card).\nFile Online\nForm Details\nI-131 | Application for Travel Documents, Parole Documents, and Arrival/Departure Records\nUse this form to apply for travel documents, parole documents, or arrival/departure records.\nFile Online\nForm Details\nI-131A | Application for Carrier Documentation\nUse this form if you are a lawful permanent resident (LPR), including an LPR with conditions, and wish to apply for a travel document (carrier documentation) that allows you to board an airline or other transportation carrier without the airline or transportation carrier being penalized.\nPay Online\nForm Details\nI-134 | Declaration of Financial Support\nUse this form to agree to provide financial support to a beneficiary of certain immigration benefits for the duration of their temporary stay in the United States.  You must file a separate Form I-134 for each beneficiary.\nForm Details\nI-140 | Immigrant Petition for Alien Workers\nUse this form to petition for an alien worker to become a permanent resident in the United States.\nForm Details\nI-191 | Application for Relief Under Former Section 212(c) of the Immigration and Nationality Act (INA)\nUse this form if you are a lawful permanent resident and wish to file for relief under former INA section 212(c).\nForm Details\nI-192 | Application for Advance Permission to Enter as a Nonimmigrant\nUse this form if you want to apply for advance permission to temporarily enter the United States and you are an: Inadmissible nonimmigrant and already have the appropriate documents; or Applicant for T or U nonimmigrant status.\nForm Details\nI-193 | Application for Waiver of Passport and/or Visa\nFor an alien who is a legal resident of the United States to reenter the United States without the alien's passport and/or visa.\nForm Details\nI-212 | Application for Permission to Reapply for Admission into the United States After Deportation or Removal\nIf you are inadmissible under sections 212(a)(9)(A) or (C) of the Immigration and Nationality Act (INA), use this form to ask for consent to reapply for admission to the United States so you can lawfully return to the United States.\nForm Details\nI-290B | Notice of Appeal or Motion\nUse this form to file:\n\nAn appeal with the Administrative Appeals Office (AAO); \nA motion with the USCIS office that issued the latest decision in your case (including a field office, service center, or the AAO); or\nCertain appeals of the denial of an Immigration and Customs Enforcement (ICE) Form I-17, “Petition for Approval of School for Attendance by Nonimmigrant Student” with the ICE Student and Exchange Visitor Program.\nForm Details\nI-356 | Request for Cancellation of Public Charge Bond\nThis form should be used to request cancellation of a public charge bond that was submitted on behalf of an alien on Form I-945, Public Charge Bond.\nForm Details\nI-360 | Petition for Amerasian, Widow(er), or Special Immigrant\nUse this form to classify an alien as:\n\nAn Amerasian (Born after 12/31/1950 and before 10/23/1982);\nThe widow(er) of a U.S. citizen;\nSelf-petitioning spouse or child of an abusive U.S. citizen or lawful permanent resident;\nSelf-petitioning  parent of an abusive U.S. citizen; or\nForm Details\nI-361 | Affidavit of Financial Support and Intent to Petition for Legal Custody for Public Law 97-359 Amerasian\nTo be filed in support of Form I-360, Petition to Classify Public Law 97-359 Amerasian as the Child, Son, or Daughter of a United States Citizen.\nForm Details\nI-363 | Request to Enforce Affidavit of Financial Support and Intent to Petition for Legal Custody for Public Law 97-359 Amerasian\nIf, after admission to the United States, the beneficiary of a petition for a Public Law 97-359 Amerasian requires enforcement of the guarantee of financial support and intent to petition for legal custody, which was executed by the beneficiary's sponsor, the beneficiary may file this form with USCIS.\nForm Details\nI-407 | Record of Abandonment of Lawful Permanent Resident Status\nUse this form to let us know you are voluntarily abandoning your status as a lawful permanent resident (LPR) of the United States. We will update your records to show you are no longer an LPR.\nForm Details\nI-485 | Application to Register Permanent Residence or Adjust Status\nUse this form to apply for lawful permanent resident status if you are in the United States.\nForm Details\nI-485 Supplement A | Supplement A to Form I-485, Adjustment of Status Under Section 245(i)\nUse this form to provide us with additional information if you are requesting to adjust status under section 245(i) of the Immigration and Nationality Act.\nForm Details\nI-485 Supplement J | Confirmation of Valid Job Offer or Request for Job Portability Under INA Section 204(j)\nUse Supplement J to: Confirm that the job offered to you in Form I-140, Immigrant Petition for Alien Workers, remains a bona fide job offer that you intend to accept once we approve your Form I 485, Application to Register Permanent Residence or Adjust Status. If you are filing or have previously filed Form I-485 based on being the beneficiary of a valid Form I-140 in an employment-based immigrant visa category that requires a job offer, you must file Supplement J instead of submitting a job offer letter; or\nRequest job portability under INA section 204(j) to a new, full-time, permanent job offer that you intend to accept once we approve your Form I-485. This new job offer must be in the same or a similar occupational classification as the job offered to you in the Form I-140 that is the basis of your Form I-485. (For more information about how we determine which jobs are same or similar, please see USCIS Policy Manual [7 USCIS-PM E.5].\nForm Details\nI-508 | Request for Waiver of Certain Rights, Privileges, Exemptions and Immunities\nUse this form to waive certain diplomatic rights privileges, exemptions, and immunities associated with your occupational status\nForm Details\nI-526 | Immigrant Petition by Standalone Investor\nThe form is used by a standalone investor to petition USCIS for status as an immigrant to the United States under section 203(b)(5) of the Immigration and Nationality Act (INA), as amended.\nForm Details\nI-526E | Immigrant Petition by Regional Center Investor\nAn investor pooling their investment with one or more qualified immigrants participating in the Regional Center Program uses this form to petition USCIS for status as an immigrant to the United States under section 203(b)(5)(E) of the Immigration and Nationality Act (INA), as amended.\nForm Details\nI-539 | Application to Extend/Change Nonimmigrant Status\nThe following groups use this form: Certain nonimmigrants extending their stay or changing to another nonimmigrant status; CNMI residents applying for an initial grant of status; F and M nonimmigrants applying for reinstatement; and, Persons seeking V nonimmigrant status or an extension of stay as a V nonimmigrant.\nFile Online\nForm Details\nI-566 | Interagency Record of Request -- A, G or NATO Dependent Employment Authorization or Change/Adjustment to/from A, G or NATO Status\nSubmit this form with your application for:\nDependent employment authorization as an eligible A-1, A-2, G-1, G-3, G-4, or NATO 1-6 dependent; or \nChange or adjustment of status to, or from, A, G or NATO status\nForm Details\nI-589 | Application for Asylum and for Withholding of Removal\nUse this form to apply for asylum in the United States and for withholding of removal (formerly called “withholding of deportation”). You may file for asylum if you are physically in the United States and you are not a U.S. citizen.\nFiling Instructions Tool\nForm Details\nI-600 | Petition to Classify Orphan as an Immediate Relative\nU.S. citizens use this form to request that USCIS classify an orphan as an immediate relative. The U.S. citizen adoptive parent or legal custodian files the petition to finalize the immigration process of a child who is not habitually resident in a Hague Convention country.\nForm Details\nI-600A | Application for Advance Processing of an Orphan Petition\nU.S. citizens who plan to adopt a foreign-born child use this form to allow USCIS to adjudicate the application that relates to the suitability and eligibility of the applicant(s) as prospective adoptive parent(s).\nForm Details\nI-601 | Application for Waiver of Grounds of Inadmissibility\nIf you are inadmissible to the United States and are seeking an immigrant visa, adjustment of status, certain nonimmigrant statuses, or certain other immigration benefits, you must file this form to seek a waiver of certain grounds of inadmissibility.\nForm Details\nI-601A | Application for Provisional Unlawful Presence Waiver\nCertain immigrant visa applicants who are relatives of U.S. citizens or lawful permanent residents may use this application to request a provisional waiver of the unlawful presence grounds of inadmissibility under Immigration and Nationality Act section 212 (a)(9)(B).\nForm Details\nI-602 | Application by Refugee for Waiver of Inadmissibility Grounds\nUse this form if you are a refugee who has been found inadmissible to the United States for reasons such as felony conviction or health conditions and you want to apply for a waiver of inadmissibility for humanitarian reasons, family unity, or national interest.\nForm Details\nI-612 | Application for Waiver of the Foreign Residence Requirement (under Section 212(e) of the Immigration and Nationality Act, as Amended)\nJ-1 and J-2 visas holders and their families may use this form to apply for a waiver of the two-year foreign residence requirement.\nForm Details\nI-687 | Application for Status as a Temporary Resident Under Section 245A of the Immigration and Nationality Act\nFor use during the Immigration and Nationality Act (INA) Section 245A legalization program of the 1986 Immigration Reform and Control Act, which ended in 1988. The form is now used to apply to USCIS for benefits under the terms and conditions of certain settlement agreements.\nForm Details\nI-690 | Application for Waiver of Grounds of Inadmissibility Under Sections 245A or 210 of the Immigration and Nationality Act\nUse this form to apply for a waiver of inadmissibility if you are an applicant for adjustment of status under section 245A or 210 of the Immigration and Nationality Act.\nForm Details\nI-693 | Report of Immigration Medical Examination and Vaccination Record\nIf you are applying for adjustment status to become a lawful permanent resident, use this form to establish that you are not inadmissible to the United States on public health grounds.\nForm Details\nI-694 | Notice of Appeal of Decision Under Sections 210 or 245A of the Immigration and Nationality Act\nUse this form to notify USCIS that an alien who was denied permanent residence, temporary residence or a waiver of grounds of inadmissibility under the amnesty program provisions of the Immigration Reform and Control Act of 1986 (IRCA) is appealing the decision to the USCIS Administrative Appeals Office.\nForm Details\nI-698 | Application to Adjust Status from Temporary to Permanent Resident (Under Section 245A of the INA)\nUse this form to apply for adjustment to permanent resident status under the amnesty program provisions of the Immigration Reform and Control Act of 1986 (IRCA).\nForm Details\nI-730 | Refugee/Asylee Relative Petition\nIf you are a principal refugee admitted to the United States within the past 2 years or a principal asylee who was granted asylum within the past 2 years, you (the petitioner) may use this form to request that your spouse and unmarried children under 21 years of age (the beneficiaries) join you in the United States.\nForm Details\nI-751 | Petition to Remove Conditions on Residence\nUse this form if you are a conditional permanent resident who obtained status through marriage and want to apply to remove the conditions on your permanent resident status.\nForm Details\nI-765 | Application for Employment Authorization\nCertain aliens aliens who are in the United States may file Form I-765, Application for Employment Authorization, to request employment authorization and an Employment Authorization Document (EAD). Other aliens aliens whose immigration status authorizes them to work in the United States without restrictions may also use Form I-765 to apply to U.S. Citizenship and Immigration Services (USCIS) for an EAD that shows such authorization.\nFile Online\nForm Details\nI-765V | Application for Employment Authorization for Abused Nonimmigrant Spouse\nCertain abused nonimmigrant spouses may use Form I-765V to request an employment authorization document (EAD).\nForm Details\nI-800 | Petition to Classify Convention Adoptee as an Immediate Relative\nUse this form to determine the child's eligibility for classification as a Convention adoptee.\nForm Details\nI-800A | Application for Determination of Suitability to Adopt a Child from a Convention Country\nUSCIS uses this form to adjudicate the eligibility and suitability of the applicant(s) who want to adopt a child who is habitually resident in a Hague Adoption Convention country.\nForm Details\nI-817 | Application for Family Unity Benefits\nUse this form to request initial benefits under the Family Unity Program, or to request an extension of such benefits.\nForm Details\nI-821 | Application for Temporary Protected Status\nIf you believe you are an eligible national of a designated country or a person without nationality who last habitually resided in the designated country, use this form to apply for Temporary Protected Status (TPS).\nFile Online\nForm Details\nI-821D | Consideration of Deferred Action for Childhood Arrivals\nUse this form to request that we consider a renewal of your deferred action status on a case-by-case basis.\nFile Online\nForm Details\nI-824 | Application for Action on an Approved Application or Petition\nUse this form to request additional action on a previously approved application or petition.\nForm Details\nI-829 | Petition by Investor to Remove Conditions on Permanent Resident Status\nUse this form if you are a conditional permanent resident who obtained status through entrepreneurship and want to remove the conditions on your residence.\nForm Details\nI-854 | Inter-Agency Alien Witness and Informant Record\nLaw enforcement agencies use Form I-854A to request an alien witness and/or informant receive classification as an S nonimmigrant.\nForm Details\nI-864 | Affidavit of Support Under Section 213A of the INA\nMost family-based immigrants and some employment-based immigrants use this form to show they have adequate means of financial support and are not likely to rely on the U.S. government for financial support.\nForm Details\nI-864A | Contract Between Sponsor and Household Member\nUse this form if you are a household member and want to promise to make your income and/or assets available to help support sponsored immigrants.\nForm Details\nI-864EZ | Affidavit of Support Under Section 213A of the INA\nUse this form to show that the applying immigrant has adequate means of financial support and is not likely to rely on the U.S. government for financial support.\nForm Details\nI-864P | 2025 HHS Poverty Guidelines for Affidavit of Support\nUse the HHS Poverty Guidelines to complete Form I-864, Affidavit of Support Under Section 213A of the INA.\nForm Details\nI-865 | Sponsor's Notice of Change of Address\nUse this form to report a sponsor's new address and/or residence\nForm Details\nI-881 | Application for Suspension of Deportation or Special Rule Cancellation of Removal (Pursuant to Section 203 of Public Law 105-100 (NACARA))\nUse this form if you are an alien who is eligible to apply for suspension of deportation or special rule cancellation of removal under the Nicaraguan Adjustment and Central American Relief Act (NACARA).\nForm Details\nI-905 | Application for Authorization to Issue Certification for Health Care Workers\nUse this form if you work with an organization and want to apply for authorization to issue certificates to health care workers.\nForm Details\nI-907 | Request for Premium Processing Service\nUse this form to request faster processing of Form I-129, Petition for a Nonimmigrant Worker, Form I-140, Immigrant Petition for Alien Workers, and certain classifications of Form I-765, Application for Employment Authorization.\nFile Online\nForm Details\nI-910 | Application for Civil Surgeon Designation\nUse this form to apply for civil surgeon designation. You do not need to apply for civil surgeon designation if you fall under the limited blanket designations for military physicians and state and local health departments.\nForm Details\nI-912 | Request for Fee Waiver\nUse this form to request a fee waiver (or submit a written request) for certain immigration forms and services based on a demonstrated inability to pay.\nForm Details\nI-914 | Application for T Nonimmigrant Status\nUse this form to request temporary immigration benefits if you are a victim of a severe form of trafficking in persons, also known as human trafficking.\nForm Details\nI-918 | Petition for U Nonimmigrant Status\nIf you are an alien and are a victim of a qualifying criminal activity, use this form to petition for temporary immigration benefits for yourself and your qualifying family members, as appropriate.\nForm Details\nI-929 | Petition for Qualifying Family Member of a U-1 Nonimmigrant\nUse this form to request immigration benefits on behalf of a family member who never held U nonimmigrant status.\nForm Details\nI-941 | Application for Entrepreneur Parole\nUse this form if you are an entrepreneur and want to: Make an initial request for parole based upon significant public benefit; Make a subsequent request for parole for an additional period; or File an amended application to notify USCIS of a material change.\nForm Details\nI-945 | Public Charge Bond\nIf we determine that an applicant is inadmissible based on the public charge ground, but is otherwise admissible, the applicant may be admitted in the discretion of the secretary of homeland security after posting a suitable and proper bond. Before an applicant may post a public charge bond (on Form I-945), we must invite them to do so. The public charge bond is posted as security for performance and fulfillment of the financial obligations of a bonded alien to the U.S. government.\nForm Details\nI-956 | Application for Regional Center Designation\nUse Form I-956 to request U.S. Citizenship and Immigration Services (USCIS) designation as a regional center under Immigration and Nationality Act (INA) section 203(b)(5)(E), or to request an amendment to an approved regional center designated under INA 203(b)(5)(E).\nForm Details\nI-956F | Application for Approval of an Investment in a Commercial Enterprise\nA designated regional center uses this form to request approval of each particular investment offering through an associated new commercial enterprise.\nForm Details\nI-956G | Regional Center Annual Statement\nDesignated regional centers use this form to provide required information, certifications and evidence to support their continued eligibility for regional center designation.\nForm Details\nI-956H | Bona Fides of Persons Involved with Regional Center Program\nEach person involved with a regional center, new commercial enterprise, or affiliated job-creating entity must complete and submit Form I-956H, Bona Fides of Persons Involved with Regional Center Program and the biometric services fee as a distinct filing along with Form I-956, Application for Regional Center Designation, Form I-956F, Application for Approval of Investment in a New Commercial Enterprise, or when persons must otherwise attest to their compliance with section 203(b)(5)(H) of the Immigration and Nationality Act.\nForm Details\nI-956K | Registration for Direct and Third-Party Promoters\nEach person acting as a direct or third-party promoter (including migration agents) of the following must complete Form I-956K: A regional center; Any new commercial enterprises; An affiliated job-creating entity; or An issuer of securities intended to be offered to immigrant investors in connection with a particular capital investment project.\nForm Details\nN-300 | Application to File Declaration of Intention\nUse this form if you are a permanent resident and want to declare your intent to become a U.S. citizen.\nForm Details\nN-336 | Request for a Hearing on a Decision in Naturalization Proceedings (Under Section 336 of the INA)\nUse this form to request a hearing before an immigration officer on the denial of your Form N-400, Application for Naturalization.\nFile Online\nForm Details\nN-400 | Application for Naturalization\nUse this form to apply for U.S. citizenship.\nFile Online\nForm Details\nN-426 | Request for Certification of Military or Naval Service\nThis form is used by an applicant for naturalization to request that the Department of Defense verify the applicant's military or naval service.\nForm Details\nN-470 | Application to Preserve Residence for Naturalization Purposes\nUse this form if you are a lawful permanent resident who must leave the United States for a period of one year or longer to engage in qualifying employment and you want to preserve your residence to pursue naturalization.\nForm Details\nN-565 | Application for Replacement Naturalization/Citizenship Document\nUse this form to apply for a replacement Declaration of Intention; Naturalization Certificate; Certificate of Citizenship; or Repatriation Certificate; or to apply for a special certificate of naturalization as a U.S. citizen to be recognized by a foreign country.\nFile Online\nForm Details\nN-600 | Application for Certificate of Citizenship\nUse this form to apply for a Certificate of Citizenship.\nFile Online\nForm Details\nN-600K | Application for Citizenship and Issuance of Certificate Under Section 322\nChildren who regularly reside in a foreign country may use this form to claim U.S. citizenship based on their parents.\nFile Online\nForm Details\nN-644 | Application for Posthumous Citizenship\nThe certificate establishes only that the person is considered to be a citizen of the United States as of the date of his/her death, and is invalid for all other purposes.\nForm Details\nN-648 | Medical Certification for Disability Exceptions\nUse this form if you are applying for U.S. citizenship and need to request an exception to the English and civics testing requirements for naturalization because of physical or developmental disability or mental impairment.\nForm Details\nWas this page helpful?\nYes\nNo\nThis page was not helpful because the content:\nSelect a reason\nhas too little information\nhas too much information\nis confusing\nis out of date\nother\nHow can the content be improved?\n0\n/ 2000\nTo protect your privacy, please do not include any personal information in your feedback. Review our\nPrivacy Policy\n.", "metadata": {}, "timestamp": "2025-03-08T13:45:56.725797"}
